package 스레드;

import 생명체.생존자.생존자;
import 생명체.좀비.좀비;
import 아이템.살점;
import java.util.Scanner;

/*
public class 생존자스레드 implements Runnable {

    //-----------------------------설정값----------------------------------

    Scanner 입력 = new Scanner(System.in); //스캐너 시작

    생존자 생존자값 = new 생존자(
            "당신이름","",1,300,
            1500,1500,
            0,140000,0,0);
    좀비 좀비값 = new 좀비();

    좀비 오렌지좀비값 = new 좀비(
            "오렌지좀비", "당신이름","오렌지맛 산성 뱉기","카악 퉤~~!!!",1,130,
            1800,1800, 생존자값.공격력,8000, 600);

    살점 오렌지살점 = new 살점("오렌지좀비의 살점", 4, 2,"1.");



    //-----------------------------설정값----------------------------------



    @Override
    public void run() {


        System.out.println("1.공격  2.아이템 공격");


        while (오렌지좀비값.남은체력 > 0) {

            // 좀비 체력 남은경우

            생존자값.공격(오렌지좀비값);  //생-->좀비 : 공격, 공격값
            if (오렌지좀비값.남은체력 > 0) {

                //공격결과 : 좀비 대사
                생존자값.공격_결과(오렌지좀비값);


                int 스레드_생 = 입력.nextInt();



                System.out.println("이제 당신의 반격");


            } else {


            }

        }




            //승리결과, 보상, 레벨업 한번에
            생존자값.보상한번에(오렌지좀비값);

            오렌지살점.보상_살점(오렌지좀비값);

            오렌지좀비값.사망_보상_출력(좀비값);
/*        try {
            Thread.sleep(500);
        } catch (InterruptedException e) {
        }*/



            //승리의춤

/*
            생존자값.승리win();
            System.out.println("생존자스레드 출력");
/*
            try {
                Thread.sleep(500);
            } catch (InterruptedException e) {
            }
*/



/*
    }

}


*/