package 스레드;

import 생명체.생명체;
import 스레드.button;

public class 엔터스킵스레드 implements Runnable{

/*    Scanner 입력값 = new Scanner(System.in);*/
    button bt;
    생명체 생;
    int 슬립속도;

    public 엔터스킵스레드(button e, 생명체 생){

        this.생 = 생;
        this.bt = e;

    }
    
    
    public void run() {


        슬립속도 = 200;


            생.멘트sleep(슬립속도, "2", "0", "x",
                    "x", "년", "도", " 한",
                    "국", ", ", "좀",bt);

            생.멘트sleep(슬립속도, "비", "바", "이",
                    "러", "스", "가", " ",
                    "창", "궐", "했",bt);

            생.멘트sleep(슬립속도, "습", "니", "다",
                    ". \n\n", "방", "사", "능",
                    "에", " ", "오",bt);

            생.멘트sleep(슬립속도, "염", "된", " ",
                    "좀", "비", "를", " ",
                    "피", "해", " ",bt);


            생.멘트sleep(슬립속도, "탈", "출", " ",
                    "하", "십", "시", "오",
                    ".\n\n", "통", "신",bt);

            생.멘트sleep(슬립속도, "기", "계", "를",
                    "만", "들", "면", " ",
                    "U", "N", "군",bt);


            생.멘트sleep(슬립속도, "이", " ", "와",
                    "줄", "지", "도", " ",
                    "모", "르", "겟",bt);


            생.멘트sleep(슬립속도, "네", "요", ".",
                    ".", ".\n\n", "그", "럼",
                    " ", "행", "운",bt);


            생.멘트sleep(슬립속도, "을", "빕", "니",
                    "다.", ".", ".", ".",
                    ".", "\n\n\n\n", "당신의 이름을 말씀해주세요 : ",bt);


        //음악 스레드(키보드) 정지
        bt.키보드onOff = false;  //이거 적용됨.. 근데 도중에 왜 안 멈추지?
/*
        System.out.println("false값 넣음");
*/

/*                //내부에서 한 번 판단하게 해보자.
                if (bt.엔터skip.equals("")) {
                    break;
                }*/

            

    }
    


}
