package 아이템.부품;
/*

public class 통신장치부품1 extends 부품 {


    //------------------------ 필드 ------------------------
        public String 품명 = "통신장치부품1 : 배터리";
        public int 가격 = 20000;
        public int 갯수 = 1;

     public String 품명;
    public int 가격;
    public int 갯수;

    //------------------------ 생성자------------------------
     public 통신장치부품1(){

        //필드초기화

         this.품명 = 품명;
         this.가격 = 가격;
         this.갯수 = 갯수;

    } // 디폴트생성자 직접 추가

    public 통신장치부품1(String 품명, int 가격, int 갯수) {
        super(품명, 가격, 갯수);

        //필드초기화
        this.품명 = 품명;
        this.가격 = 가격;
        this.갯수 = 갯수;
    }

    //------------------------ 메소드 ------------------------



}
*/