import java.util.Scanner;

public class 별 {

    public static void main(String[] args) {


        //스캐너
        Scanner 사용자입력 = new Scanner(System.in);
        System.out.print("입력값 : ");
        int 입력값 = 사용자입력.nextInt();

        int 가로 = 입력값*8;   //입력값 1: 17
        int 세로 = 입력값*19;  //입력값 1: 39


        //변수
        char 별 = '*';
        char 띄 = '_';


        //바둑판
        char[][] 바둑판 = new char[2*가로+1][2*세로+1];
        //2n+1 X 2n+1
        //39씩, 17씩 커지게 만듦


        //나머지 빈칸 채우기
        for (int i=0; i<2*가로+1; i++) {
            for (int j=0; j<2*세로+1; j++) {
                바둑판[i][j] = 띄;
            }
        }


        //============================ 별 조합하기 ============================

        //2.제일 큰 삼각형

        for (int i=0; i<2*가로+1; i++) {
            for (int j=세로-i; j<세로+1+i; j++) {
                바둑판[i][j] = 별;
            }
        }



        //팔부분 삼각형

        for (int i=입력값*5; i<입력값*12; i++) {
            for (int j=3*i-세로+4*입력값; j<3*세로-3*i-4*입력값+1; j++) {
                바둑판[i][j] = 별;
            }
        }



        //3.작은 삼각형(파먹기)
        //3-1. 첫번째줄, 중간, 마지막줄 조건문사용


        //첫째줄
        //입력값만큼 엉덩이가 벌어지는 문제 --> if로 제한
        if (입력값<3) {
            for (int j=세로-입력값+1; j<세로+입력값; j++) {
                바둑판[2*가로-4*입력값][j] = 띄;
            }
        } else {
            for (int j=세로-1; j<세로+2; j++) {   //엉덩이 3칸만 벌어짐
                바둑판[2*가로-4*입력값][j] = 띄;

            }
        }



        //중간
        int i = i=2*가로-4*입력값+1;

        //엉덩이 두번째줄이 입력값만큼 벌어지는 문제 --> j출력 길이로 구분
        if (바둑판[i].length < 11) {
            for (i=2*가로-4*입력값-1; i<2*가로; i++) {
                for (int j=3*세로+8*입력값+3-4*i; j<4*i-세로-8*입력값-2; j++) {
                    바둑판[i][j] = 띄;
                }
            }
        } else if (바둑판[i].length >= 11) {

            for (i=2*가로-4*입력값+1; i<2*가로; i++) {
                for (int j=3*세로+8*입력값-4*i+2*입력값; j<4*i-세로-8*입력값-2*입력값+1; j++) {
                    바둑판[i][j] = 띄;
                }
            }

        }


        //마지막줄
        //발끝이 * 하나로 끝나게 만들기 위해 따로 코드 짬.
        for (int j=세로-15*입력값-입력값+1; j<세로+15*입력값+입력값; j++) {
            바둑판[2*가로][j] = 띄;
        }



        //============================ 전체 출력 ============================

        for (i=0; i<2*가로+1; i++) {
            for (int j=0; j<2*세로+1; j++) {
                System.out.print(바둑판[i][j]);
            }
            System.out.println();
        }



    }//~main
}//~class